In [10]:
import pandas as pd

# 데이터 프레임 생성
data = {
    'Name' : ['son', 'king', 'scott'],
    'age' : [20, 30, 35]
}

df = pd.DataFrame(data)

In [11]:
print(df)

    Name  age
0    son   20
1   king   30
2  scott   35

In [4]:
s1 = pd.Series([100,200,300], index=['a','b','c'])
print(s1)

a    100
b    200
c    300
dtype: int64

In [12]:
print(s1['b'])
print(s1['c'])
print(s1['a'])
print(s1.index)
print(s1.values)

200
300
100
Index(['a', 'b', 'c'], dtype='object')
[100 200 300]

In [14]:
# 데이터 프레임 생성
data = {
    'Name' : ['son', 'king', 'scott'],
    'age' : [20, 30, 35]
}

df = pd.DataFrame(data)

In [16]:
df

    Name  age
0    son   20
1   king   30
2  scott   35

In [24]:
print(df.head())
print(df.head(2))
print(df.head(1))
print(df.tail())
print(df.tail(1))

    Name  age
0    son   20
1   king   30
2  scott   35
   Name  age
0   son   20
1  king   30
  Name  age
0  son   20
    Name  age
0    son   20
1   king   30
2  scott   35
    Name  age
2  scott   35

In [26]:
df.shape

(3, 2)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [32]:
df.describe()

             age
count   3.000000
mean   28.333333
std     7.637626
min    20.000000
25%    25.000000
50%    30.000000
75%    32.500000
max    35.000000

In [35]:
df[df['age'] > 25]

    Name  age
1   king   30
2  scott   35

In [36]:
data = {
    'name' : ['son', 'king', 'scott'],
    'age' : [30, 40, 25],
    'score' : [90, 85, 95]
}

df = pd.DataFrame(data)

In [40]:
chk_score = df[df['score'] >= 90]
print(chk_score)

    name  age  score  passed
0    son   30     90    True
2  scott   25     95    True

In [41]:
df['passed'] = df['score']>=90

In [43]:
df

    name  age  score  passed
0    son   30     90    True
1   king   40     85   False
2  scott   25     95    True

In [48]:
new_row = {
    'name': ['cool'],
    'age': 20,
    'score': 88,
    'passed': False
}
df2 = pd.DataFrame(new_row)

In [ ]:
print(df)
print(df2)

    name  age  score  passed
0    son   30     90    True
1   king   40     85   False
2  scott   25     95    True
   name  age  score  passed
0  cool   20     88   False

In [56]:
# df = pd.concat(df2, ignore_index=True)

df.loc[0, 'score'] = 90

In [57]:
print(df)

    name  age  score  passed
0    son   30     90    True
1   king   40     85   False
2  scott   25     95    True

In [59]:
df =pd.concat([df,df2],ignore_index=True)

In [64]:
df

    name  age  score  passed
0    son   30     90    True
1   king   40     85    True
2  scott   25     95    True
3   cool   20     88    True
4   cool   20     88    True

In [74]:
df['passed'] = df['score']>=80

In [66]:
df.loc[1, 'score'] = None

In [67]:
df

    name  age  score  passed
0    son   30   90.0    True
1   king   40    NaN    True
2  scott   25   95.0    True
3   cool   20   88.0    True
4   cool   20   88.0    True

In [68]:
df.isnull()

    name    age  score  passed
0  False  False  False   False
1  False  False   True   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False

In [70]:
df['score'] = df['score'].fillna(0)

In [71]:
df

    name  age  score  passed
0    son   30   90.0    True
1   king   40    0.0    True
2  scott   25   95.0    True
3   cool   20   88.0    True
4   cool   20   88.0    True

In [75]:
df = df.dropna()

In [76]:
df

    name  age  score  passed
0    son   30   90.0    True
1   king   40    0.0   False
2  scott   25   95.0    True
3   cool   20   88.0    True
4   cool   20   88.0    True

In [77]:
sorted_df = df.sort_values(by='score', ascending=True)
print(sorted_df)

    name  age  score  passed
1   king   40    0.0   False
3   cool   20   88.0    True
4   cool   20   88.0    True
0    son   30   90.0    True
2  scott   25   95.0    True

In [78]:
data = {
    'team': ['A','A','B','B','C'],
    'score': [80,90,78,88,70]
}
df = pd.DataFrame(data)
print(df)

  team  score
0    A     80
1    A     90
2    B     78
3    B     88
4    C     70

In [79]:
group_data = df.groupby('team')['score'].mean()

In [80]:
group_data

team
A    85.0
B    83.0
C    70.0
Name: score, dtype: float64

In [83]:
df.to_csv('output.csv', index=False)

In [84]:
group_data.to_csv('result.csv')